In [8]:
#Q1. List any five functions of the pandas library with execution.
import pandas as pd
df=pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9,0],'b':[1,2,3,4,5,6,7,8,9,0]})
df

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
5  6  6
6  7  7
7  8  8
8  9  9
9  0  0

In [3]:
df.head(5) #shows first five rows

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [4]:
df.describe() #statistcal analysis like mean,count etc

              a         b
count  10.00000  10.00000
mean    4.50000   4.50000
std     3.02765   3.02765
min     0.00000   0.00000
25%     2.25000   2.25000
50%     4.50000   4.50000
75%     6.75000   6.75000
max     9.00000   9.00000

In [5]:
df.isnull()  #findout if there is null value

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False  False
9  False  False

In [6]:
df.duplicated() #find duplicate value

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [7]:
df.tail(5) #shows last 5 rows of data

   a  b
5  6  6
6  7  7
7  8  8
8  9  9
9  0  0

In [11]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.
import pandas as pd
df=pd.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,0],'c':[1,4,6,8,3]})
df 
new_df=df.set_index(pd.Index(range(1,len(df)*2,2)))

print(new_df)

   a  b  c
1  1  6  1
3  2  7  4
5  3  8  6
7  4  9  8
9  5  0  3

In [18]:
#You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#function should print the sum to the console.
import pandas as pd
df=pd.DataFrame({'values':[10,20,30,40,50]})
data=df.head(3)
data.sum()

values    60
dtype: int64

In [37]:
#Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#'Word_Count' that contains the number of words in each row of the 'Text' column.
import pandas as pd

def add_word_count_column(df):
    # Splitting the text into words and counting the number of words
    word_count = df['Text'].apply(lambda x: len(x.split()))
    
    # Adding a new column 'Word_Count' to the DataFrame
    df['Word_Count'] = word_count
    return df

data = {'Text': ['This is a sample text.', 'Hello world', 'Python is awesome']}
df = pd.DataFrame(data)

# Adding the 'Word_Count' column
df = add_word_count_column(df)
print(df)

                     Text  Word_Count
0  This is a sample text.           5
1             Hello world           2
2       Python is awesome           3

In [40]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?
df.shape will give you number of rows and column where as df.size will return number of elements
df.shape

(3, 2)

In [41]:
df.size

6

In [ ]:
#Q6. Which function of pandas do we use to read an excel file?
pd.read_excel()

In [46]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#'Username' in df that contains only the username part of each email address.
df=pd.DataFrame({'Email':['abc@gmail.com','def.gh@gmail.com']})
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
df

              Email Username
0     abc@gmail.com      abc
1  def.gh@gmail.com   def.gh

In [50]:
#Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#function should return a new DataFrame that contains only the selected rows.
df=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
def select_rows(df):
    # Selecting rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
df_slect=select_rows(df)
df_slect

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [53]:
df=pd.DataFrame({'values':[3,8,6,2,9,5,2,9,3,1]})
df.mean()
df.median()
df.mode()

   values
0       2
1       3
2       9

In [54]:
import pandas as pd

def calculate_moving_average(df):
    # Assuming 'Date' column is already in datetime format. If not, convert it to datetime.
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Sorting the DataFrame by date in ascending order
    df.sort_values(by='Date', inplace=True)
    
    # Calculating the moving average using a window of size 7 and including the current day
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

# Example usage:
# Creating a sample DataFrame
data = {'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05', '2024-01-06', '2024-01-07'],
        'Sales': [100, 110, 120, 130, 140, 150, 160]}
df = pd.DataFrame(data)

# Calculating the moving average
df = calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2024-01-01    100          100.0
1 2024-01-02    110          105.0
2 2024-01-03    120          110.0
3 2024-01-04    130          115.0
4 2024-01-05    140          120.0
5 2024-01-06    150          125.0
6 2024-01-07    160          130.0

In [55]:
#12
import pandas as pd

def select_rows_within_date_range(df):
    # Converting the 'Date' column to datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Selecting rows where the date is between '2023-01-01' and '2023-01-31'
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return selected_rows


# Selecting rows where the date is between '2023-01-01' and '2023-01-31'
selected_df = select_rows_within_date_range(df)
print(selected_df)

Empty DataFrame
Columns: [Date, Sales, MovingAverage]
Index: []

In [ ]:
#13
To use the basic functions of Pandas, you need to import the Pandas library.
import pandas as pd